function hi() {
  console.log("Hello World!");
}
hi();
const moment = require("moment-timezone");
module.exports.config = {
  'name': 'autotime',
  'version': "2.0.0",
  'role': 0x0,
  'author': "MR᭄﹅ MAHABUB﹅ メꪜ",
  'description': "autotime",
  'category': "AutoTime",
  'countDown': 0x3
};
module.exports.onLoad = async ({
  api: _0x1d5129
}) => {
  const _0x1aca94 = {
    "12:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nঘুমাও মানুষ টা তুমার না__||😊😅\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "01:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟏:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n___এই শহরে এত কিছু হয়শুধু আমার মৃত্যু হয় না.!>🥺\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "02:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟐:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_____💥🦋''হটাৎ কোন একদিন অজান্তে অন্ধকার এ হারিয়ে যাবো..!!>3🥀\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "03:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟑:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nদুঃখ- আমায় ভালোবাসে.!!>😅\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐂.𝐄.𝐎⸙𝐌𝐀𝐇𝐀𝐁𝐔𝐁𓆪___//🩷🪽"
    },
    "04:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟒:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n-••🌻🦋🤍বয়স বাড়বে, হারানোর তালিকা দীর্ঘ হবে, যাদের সাথে থাকার কথা ছিলো তারাও হারিয়ে যাবে..!!🦋🌼\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "04:30:00 AM": {
      'message': "╭──────────────────╮\n  🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)"
    },
    "05:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟓:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n__💜🔐🌈 __\n\n🐰!<— ❝“যে ইচ্ছেগুলো কখনোই পূরন হবার না মনটা সবসময় সেটা নিয়েই পড়ে থাকে” ❞ -!!-) 🙃🥀🌻\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "06:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟔:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\_🌸🖤  -𝗣𝗲𝗼𝗽𝗹𝗲 𝗟𝗼𝘀𝘁 𝗜𝗻 𝗘𝘅𝘁𝗿𝗲𝗺𝗲 𝗣𝗿𝗶𝗱𝗲 𝗡𝗲𝘃𝗲𝗿 𝗖𝗼𝗺𝗲 𝗕𝗮𝗰𝗸-!!🙂🐰\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "07:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟕:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n𝐎𝐧𝐞 𝐃𝐚𝐲...☺️\n           ___ღ𝐈𝐧 𝐬𝐡𝐚 𝐀𝐥𝐥𝐚𝐡..😊🖤\n_একদিন আমার মৃত্যুর  খবর শুনে সবাই মুচকি হেসে বলবে...!💔\n_ইন্না-লিল্লাহি ওয়া ইন্না ইলাইহির রাজিউন.!🙂\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "08:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\-“🐰♡︎𝗕𝗲✨🍥𝗠𝗶𝗻𝗲-!<😻🍭\n\n-!🧚‍♀️𝗜🐼-𝗪𝗶𝗹𝗹✨🍒𝗸𝗲𝗲𝗽😽𝘆𝗼𝘂-🧸💜-𝗙𝗼𝗿𝗲𝘃𝗲𝗿:)🌈\n\n🍒তুমি আমার সাধ্যের বাহিরে চাওয়া এক সুন্দর মানুষ।।🙂💔🥀\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "09:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟗:𝟎𝟎 𝐀𝐌 🩷«—•\n \n✢━━━━━━━━━━━━━━━✢\n\n°🐹💙_𝗧𝗿𝘂𝘀𝘁 M𝗲 🔐\n\n  - 𝗜 𝗮𝗹𝘄𝗮𝘆𝘀 𝗯𝗲𝗹𝗶𝗲𝘃𝗲 𝘁𝗵𝗮𝘁)🐰\n\n__!!>☁️✨🌻''--ভালোবাসি বলেই কি পেতে হবে,,!!🥀\n\n --থাকুক না কিছু ভালোবাসা অপূর্ণ..!!🖤💜🙂💫 ✨\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "10:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟎:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n—-༄༎🖤༎ྂ•——༄༎•গল্পটা তখনই ভালো ছিলো 😊🌸\n\nযখন তুমি ছিলে অপরিচিত আর আমি ছিলাম আমার আমিতে সীমাবদ্ধ༄༎•🙂🖤🦋\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "11:00:00 AM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟏:𝟎𝟎 𝐀𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_____🐰💫🤍\n\n♡︎– আমার পূর্ণতায়; তাকেই পাশে রাখবো; যে আমার শূন্যতায়; পাশে ছিলো !-🌻🖤\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
    },
    "12:00:00 PM": {
      'message': "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n -{
  "01:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟏:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_The aimless existence of a penniless traveler 😅\n_ The intoxicated loneliness of the path of hardship 🖤🌺\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "02:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟐:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n𝗟𝗶𝗳𝗲 𝗶𝘀 𝗯𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹 𝗶𝗳 𝘆𝗼𝘂 𝗗𝗼𝗻𝘁 𝗙𝗮𝗹𝗹 𝗶𝗻 𝗟𝗼𝘃𝗲 \n\n♡︎_Life is beautiful if you don't fall into someone's love -🙂💔\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "03:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟑:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n_𝗣𝗲𝗵𝗹𝗶 𝗡𝗮𝘇𝗮𝗿 𝗠𝗮𝗶𝗻 𝗞𝗮𝗶𝗦𝗔 𝗝𝗔𝗱𝘂 𝗞𝗮𝗿 𝗗𝗶𝘆𝗔 🫶👀✨\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "04:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟒:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n━𝙈𝙮 𝘿𝙧𝙚𝙖𝙢𝙨 𝘿𝙤 𝙣𝙤𝙩 𝘾𝙤𝙢𝙚🌸\n       𝙩𝙧𝙪𝙚 𝙡𝙣 𝙡𝙢𝙖𝙜𝙞𝙣𝙖𝙩𝙞𝙤𝙣__🌼\n\n❥༊My dreams are better in imagination than in reality 🥀🌸🙂\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "05:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟓:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n🍒---I am that storybook-🙂 -That book which everyone can read-😌 -But no one has the ability to understand the meaning..!☺️🥀💔\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "06:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nNow it is 6 PM, after the Maghrib Azan, everyone should pray 🥀 and then come home, have some food, and spend time with the family 😍\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "06:30:00 PM": {
    "message": "╭──────────────────╮\n  🌸 𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\nName                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\nFather•𝚜 Name    : 𝐀𝐝𝐨𝐦 (ah:)\nCreator               : 𝐀𝐥𝐥𝐚𝐡\nIdeal                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (sa.)\nHoly Book           : 𝐐𝐮𝐫𝐚𝐧\nReligion            : 𝐈𝐬𝐥𝐚𝐦\nIdentity            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله\nHobbies               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲\nPresent Address           : 𝐃𝐮𝐧𝐢𝐲𝐚\nPermanent Address      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)"
  },
  "07:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟳:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nNow it's 7 PM, everyone sit down with a book and read 🥰\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "08:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nNow it's 8 PM, after the Isha Azan, everyone pray ❤️😘\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "09:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟎𝟗:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nNow it's 9 PM, everyone have dinner and go to sleep 🥱\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "10:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟎:"10:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟎:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\nNow it's 10 PM, everyone is sleeping. I don't have a wife, so I can't sleep either 😭\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  },
  "11:00:00 PM": {
    "message": "•—»🩷 𝐓𝐈𝐌𝐄 𝟏𝟏:𝟎𝟎 𝐏𝐌 🩷«—•\n  \n✢━━━━━━━━━━━━━━━✢\n\n- I was able to stop suicide, but I couldn't stop the soul's suicide__||🖤😊💔\n\n✢━━━━━━━━━━━━━━━✢\n\⃝—͟͟͞͞ 𝐃𝐢𝐝𝐚𝐫 𝐄𝐢𝐧𝐬𝐭𝐞𝐢𝐧'𝐬"
  }
    }
  const _0x2c827b = () => {
    const _0xde61e3 = moment().tz("Asia/Dhaka");
    const _0x36cc76 = _0xde61e3.format("hh:mm:ss A");
    const _0x3185db = _0x1aca94[_0x36cc76];
    if (_0x3185db) {
      const _0x4c3da8 = global.db.allThreadData.map(_0x16cca0 => _0x16cca0.threadID);
      _0x4c3da8.forEach(async (_0x15884f, _0x53e397) => {
        _0x1d5129.sendMessage({
          'body': _0x3185db.message
        }, _0x15884f);
      });
    }
    const _0x5be7d3 = moment().add(0x1, 'minute').startOf('minute');
    const _0x39a664 = _0x5be7d3.diff(moment());
    setTimeout(_0x2c827b, _0x39a664);
  };
  _0x2c827b();
};
module.exports.onStart = () => {};
